<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link 
        href="https://fonts.googleapis.com/css2?family=Lato:wght@300;400&family=Lobster&family=Montserrat:ital,wght@0,300;0,700;1,700;1,800&display=swap"
        rel="stylesheet"
    >

    <link href='https://unpkg.com/boxicons@2.1.4/css/boxicons.min.css' rel='stylesheet'>
    <link rel="stylesheet" href="styles/normalize.css" />
    <link rel="stylesheet" href="styles/styles.css" />
    
    <title>Linux</title>
    
</head>
<body>
    <div class="container">
    <header class="">
    <!-- ********* header Here ***********-->
    <nav class="navbar">
        <a href="#" class="logo"><img
            class="logo-image"
            src="assets/logos/Tux.svg.png"
            alt=" logo Linux"
        />
        </a>
        <input type="checkbox" id="toggler">
        <label for="toggler"><i class='bx bx-menu'></i></label>
        <div class="menu">
            <ul class="list">
                <li><a href="pages/historia.html">Historia</a></li>
                <li><a href="pages/experiencias.html">Experiencias</a></li>
                <li><a href="pages/distribuciones.html">Recomendaciones</a></li>
                <li><a href="pages/soft-libre.html">Software Libre</a></li>
                <li><a href="pages/supercomputadoras.html">Super Computadoras</a></li>
            </ul>
        </div>
    </nav>
    
        <h1 class="title">Desempe&#241;o Linux</h1>
    </header>
    <main class="bg-red">
        <!-- *********** Main Here *********-->
        <p>  </p>
        <p>
            La elecci&#243;n de Linux como sistema operativo se basa en una serie de consideraciones fundamentadas en investigaciones en la web, casos de uso y experiencias de implementaci&#243;n. A continuaci&#243;n, se detallan las razones para usar Linux en lugar de sistemas operativos como Microsoft Windows:
        </p>
        
        <p>

        </p>
    </main>
    <section class="bg-pink">
        <span class="content-icons">
        <i class='bx bx-code-alt '></i>
        </span>
        <p>
            <b>C&#243;digo Abierto:</b> Linux es un sistema de c&#243;digo abierto, lo que significa que su c&#243;digo fuente est&#225; disponible para cualquier persona que desee examinarlo y revisarlo. Esta transparencia promueve la confianza y la seguridad, ya que la comunidad puede evaluar y mejorar el software de manera colaborativa.
        </p>
        <span class="content-icons">
            <i class='bx bx-lock'></i>
        </span>
        <p>
            <b>Seguridad:</b> En comparaci&#243;n con Windows, Linux tiene ventajas en t&#233;rminos de seguridad. Esto se debe a su enfoque en la gesti&#243;n de paquetes y al concepto de un repositorio de software. Estos elementos permiten un control m&#225;s estricto sobre la fuente de las aplicaciones, reduciendo la vulnerabilidad a malware.
        </p>
        <span class="content-icons">
            <i class='bx bx-leaf' ></i>
            </span>
        <p>
            <b>Eficiencia en Recursos:</b> Linux es conocido por su eficiencia en el uso de recursos. Incluso en sistemas con hardware m&#225;s antiguo, es posible encontrar distribuciones de Linux que funcionen bien con recursos limitados, a menudo requiriendo menos memoria RAM que los sistemas Windows m&#225;s recientes.
        </p>
        <span class="content-icons">
            <i class='bx bxs-brush' ></i>
            </span>
        <p>
            <b>Personalizaci&#243;n:</b> Linux ofrece una gran flexibilidad en t&#233;rminos de personalizaci&#243;n. Los usuarios pueden cambiar los entornos gr&#225;ficos y temas para adaptar el sistema a sus gustos y necesidades espec&#237;ficas.
        </p>
        <span class="content-icons">
            <i class='bx bx-disc'></i>
            </span>
        <p>
            <b>Variedad de Distribuciones:</b> Existe una amplia variedad de distribuciones de Linux, cada una dise&#241;ada para satisfacer necesidades espec&#237;ficas. Desde distribuciones orientadas a la programaci&#243;n hasta aquellas destinadas a la ciberseguridad, hay una opci&#243;n para casi cualquier caso de uso.
        </p>
        <span class="content-icons">
            <i class='bx bx-purchase-tag'></i>
            </span>
        <p>
            <b>Gratuito:</b> Linux es software libre, lo que significa que no requiere licencias ni pagos para su uso. Esto elimina la necesidad de recurrir a pr&#225;cticas de pirater&#237;a y hace que las distribuciones de Linux sean accesibles para todos.
        </p>
        <span class="content-icons">
            <i class='bx bx-wrench'></i>
            </span>
        <p>
            <b>Soporte Comunitario:</b> La comunidad de Linux es conocida por su amplio y activo soporte. Los usuarios pueden encontrar ayuda en foros y comunidades en línea, donde desarrolladores, programadores y otros usuarios finales están dispuestos a brindar asistencia de forma gratuita.
        </p>
        
        <p>
            Estas razones respaldadas por investigaciones y experiencias de implementaci&#243;n demuestran por qu&#233; Linux es una elecci&#243;n s&#243;lida como sistema operativo en una amplia variedad de escenarios.
        </p>

        <p>
            Fuente: <a href="https://www.profesionalreview.com/2022/11/12/razones-instalar-linux/">
                        https://www.profesionalreview.com/2022/11/12/razones-instalar-linux/
                    </a>
        </p>
    </section>
    <article class="bg-blue">
        
        <div class="youtube-wrapper">
            <div class="youtube">
                <iframe 
                    width="560" 
                    height="315" 
                    src="https://www.youtube.com/embed/hpWQNfei6kc?si=sddDcVlCjlgg8LF3&amp;start=33" 
                    title="YouTube video player" 
                    frameborder="0" 
                    allow="accelerometer; 
                    autoplay; 
                    clipboard-write; 
                    encrypted-media; 
                    gyroscope; 
                    picture-in-picture; 
                    web-share" allowfullscreen>
                </iframe>
            </div>
        </div>
    </article>
    <footer class="bg-pink">
        <!--********** footer Here ************-->
        <p class="foot_later"><b>Integrantes:</b></p>
        <p class="foot_later">| Jorge Valle |</p>
        <p class="foot_later">| Facundo Paron |</p>
        <p class="foot_later">| Ezequiel Su&#225;rez|</p>
    </footer>
    </div>
</body>
</html>