<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link 
        href="https://fonts.googleapis.com/css2?family=Lato:wght@300;400&family=Lobster&family=Montserrat:ital,wght@0,300;0,700;1,700;1,800&display=swap"
        rel="stylesheet"
    >

    <link href='https://unpkg.com/boxicons@2.1.4/css/boxicons.min.css' rel='stylesheet'>
    <link rel="stylesheet" href="../styles/normalize.css" />
    <link rel="stylesheet" href="../styles/styles.css" />
    
    <title>Recomendaciones</title>
    
</head>
<body>
    <div class="container">
    <header class="">
    <!-- ********* header Here ***********-->
    <nav class="navbar">
        <a href="../index.html" class="logo"><img
            class="logo-image"
            src="../assets/logos/Tux.svg.png"
            alt=" logo Linux"
        />
        </a>
        <input type="checkbox" id="toggler">
        <label for="toggler"><i class='bx bx-menu'></i></label>
        <div class="menu">
            <ul class="list">
                <li><a href="historia.html">Historia</a></li>
                <li><a href="experiencias.html">Experiencias</a></li>
                <li><a href="distribuciones.html">Recomendaciones</a></li>
                <li><a href="soft-libre.html">Software Libre</a></li>
                <li><a href="supercomputadoras.html">Super Computadoras</a></li>
            </ul>
        </div>
    </nav>
    
        <h1 class="title">Recomendaciones</h1>
    </header>
    <main class="bg-red">
        <!-- *********** Main Here *********-->
        <h2>Para una PC B&#225;sica</h2>
        <p>
            Dentro del abanico de distribuciones de GNU/Linux disponibles, una destacada elecci&#243;n para aquellos que deseen iniciar su viaje en el desarrollo de sistemas, y que tambi&#233;n es apta para usuarios finales, es Ubuntu. Esta distribuci&#243;n es ampliamente reconocida y cuenta con un s&#243;lido respaldo por parte de la comunidad de c&#243;digo abierto.
        </p>
        <p>
            Ubuntu utiliza el entorno gr&#225;fico GNOME, que se caracteriza por su gran intuici&#243;n, lo que resulta especialmente beneficioso para aquellos que se inician en el mundo de los entornos Linux. Ofrece un acceso sencillo al sistema de archivos y destaca por su estabilidad, lo que brinda un entorno confiable para el desarrollo de sistemas y aplicaciones.
        </p>
        <p>
            En cuanto a las herramientas recomendadas para dar los primeros pasos en el desarrollo de software en entornos GNU/Linux, estas son algunas de las opciones:
        </p>
        <span class="content-icons">
            <i class='bx bxs-terminal'></i>
        </span>
        <p>
            Terminal GNOME: Una herramienta fundamental que permite la interacci&#243;n con el sistema a trav&#233;s de la l&#237;nea de comandos.
        </p>
        <span class="content-icons">
            <i class='bx bxl-visual-studio'></i>
        </span>
        <p>
            IDE (Entorno de Desarrollo Integrado): Para la codificaci&#243;n, una elecci&#243;n popular es Visual Studio Code, que se destaca por su versatilidad y amplia comunidad de usuarios. Puedes encontrar m&#225;s informaci&#243;n sobre Visual Studio Code en este video.
        </p>
        <span class="content-icons">
            <i class='bx bxl-github'></i>
        </span>
        <p>
            Gesti&#243;n de versiones: Para el control de versiones, GitHub es una plataforma ampliamente conocida y utilizada en la comunidad de desarrollo de software.
        </p>
        <span class="content-icons">
            <i class='bx bxs-box'></i>
        </span>
        <p>
            Virtualizaci&#243;n: Para la creaci&#243;n y gesti&#243;n de m&#225;quinas virtuales en Ubuntu, una opci&#243;n s&#243;lida es VirtualBox, que ofrece una soluci&#243;n confiable y efectiva.
        </p>

        <p>
            En resumen, Ubuntu con su entorno GNOME es una elecci&#243;n excelente para quienes desean adentrarse en el desarrollo de sistemas en el entorno GNU/Linux. Proporciona una experiencia intuitiva, estabilidad y acceso a herramientas esenciales que facilitan el proceso de desarrollo.
        </p>
        <p>
            Fuentes: 
        </p>
        <p>
            <a href="https://geekflare.com/es/linux-desktop-environment/">
                https://geekflare.com/es/linux-desktop-environment/
            </a>
        </p>
        <p>
            <a href="https://www.somoslibres.org/index.php/36-nieuws/ubuntu/11374-ubuntu-es-la-distribucion-linux-ideal-para-los-desarrolladores-de-software
            ">
            https://www.somoslibres.org/index.php/36-nieuws/ubuntu/11374-ubuntu-es-la-distribucion-linux-ideal-para-los-desarrolladores-de-software
            </a>
        </p>
        

    </main>
    <section class="bg-pink">
        <h2>PC de Bajas prestaciones</h2>
        <p>
            Para una computadora con 2 GB de RAM y una ROM de 300 GB, junto con un procesador de gama baja, para un estudiante creo que ser&#237;a conveniente utilizar la distribuci&#243;n de Linux: “Lubuntu” porque incluso los ordenadores antiguos o menos potentes son compatibles con Lubuntu y porque como m&#237;nimo, se necesita un procesador &#250;nico de 700 MHz, una memoria de trabajo de 512 MB y 5 GB de memoria.(P&#225;gina oficial de Lubuntu: <a href="https://lubuntu.me/">https://lubuntu.me/)</a>
        </p>
        <p>
            Y el entorno de escritorio a usar seria “LXQt”. LXQt es un entorno de escritorio Qt ligero, que no estorba, ni cuelga, ni ralentiza los sistemas operativos basados en GNU/Linux. Y que, adem&#225;s, se centra en ser un escritorio cl&#225;sico con un aspecto moderno.
        </p>
        <p>
            La superficie de usuario LXQt que usa Lubuntu es clara y minimalista. Con ella, ahorra recursos y garantiza que todas las aplicaciones funcionen r&#225;pidamente y sin retrasos incluso en ordenadores antiguos. Gracias a su estructura ordenada, los usuarios nuevos pueden hacerse a ella r&#225;pidamente. No obstante, este elegante sistema tambi&#233;n prescinde de algunos efectos gr&#225;ficos.
        </p>
        <p> 
            Los pocos requisitos de hardware de Lubuntu garantizan que se pueda sacar el m&#225;ximo rendimiento a los ordenadores menos potentes y permite alargar la vida de los notebooks m&#225;s lentos o de los PC m&#225;s antiguos, que pueden seguir utiliz&#225;ndose para llevar a cabo tareas sencillas. (P&#225;gina oficial de LXQt: <a href="https://lxqt-project.org/">https://lxqt-project.org/</a>)
        </p>

    </section>
    <article class="bg-blue">
        <h2>Aplicaciones</h2>
        <p>Aplicaciones que recomendaría para tareas básicas de un alumno sería:</p>
        <figure>
            <img src="../assets/images/img-2-1.jpeg" class="img-content" alt="super computadora">
        </figure>
        <p>
            Para navegar por internet Chromium (<a href="https://www.chromium.org/">https://www.chromium.org/</a>) por ser una App ligera y de muy buen rendimiento y muy parecido a chrome
        </p>
        <figure>
            <img src="../assets/images/img-2-2.jpeg" class="img-content" alt="super computadora">
        </figure>
        <p>
            También el paquete LibreOffice (<a href="https://es.libreoffice.org/">https://es.libreoffice.org/</a>) que incluye aplicaciones de procesamientos de textos, hojas de cálculo y presentaciones
        </p>
        <figure>
            <img src="../assets/images/img-2-3.jpeg" class="img-content" alt="super computadora">
        </figure>
        <p>
            Para leer PDFs recomendar&#237;a Evince (<a href="https://wiki.gnome.org/Apps/Evince">https://wiki.gnome.org/Apps/Evince</a>) por ser ligero y bastante funcional
        </p>
        <figure>
            <img src="../assets/images/img-2-4.jpeg" class="img-content" alt="super computadora">
        </figure>
        <p>
            Un reproductor de multimedia que recomendar&#237;a es VLC Multimedia Player (<a href="https://www.videolan.org/index.es.html">https://www.videolan.org/index.es.html</a>)
        </p>
        <figure>
            <img src="../assets/images/img-2-5.jpeg" class="img-content" alt="super computadora">
        </figure>
        <p>
            Y por &#250;ltimo un editor de im&#225;genes que utilizar&#237;a seria GIMP que es un editor de im&#225;genes potente, funcional y ligero (<a href="https://www.gimp.org/">https://www.gimp.org/</a>)
        </p>
        <p>
            Fuentes: 
        </p>
        <p>
            <a href="https://ubunlog.com/lxqt/">
                https://ubunlog.com/lxqt/
            </a>
        </p>
        <p>
            <a href="https://www.ionos.es/digitalguide/servidores/configuracion/lubuntu/">
                https://www.ionos.es/digitalguide/servidores/configuracion/lubuntu/
            </a>
        </p>




    </article>
    <footer class="bg-pink">
        <!--********** footer Here ************-->
        <p class="foot_later"><b>Integrantes:</b></p>
        <p class="foot_later">| Jorge Valle |</p>
        <p class="foot_later">| Facundo Paron |</p>
        <p class="foot_later">| Ezequiel Su&#225;rez|</p>
    </footer>
    </div>
</body>
</html>