<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link 
        href="https://fonts.googleapis.com/css2?family=Lato:wght@300;400&family=Lobster&family=Montserrat:ital,wght@0,300;0,700;1,700;1,800&display=swap"
        rel="stylesheet"
    >

    <link href='https://unpkg.com/boxicons@2.1.4/css/boxicons.min.css' rel='stylesheet'>
    <link rel="stylesheet" href="../styles/normalize.css" />
    <link rel="stylesheet" href="../styles/styles.css" />
    
    <title>Experiencias</title>
    
</head>
<body>
    <div class="container">
    <header class="">
    <!-- ********* header Here ***********-->
    <nav class="navbar">
        <a href="../index.html" class="logo"><img
            class="logo-image"
            src="../assets/logos/Tux.svg.png"
            alt=" logo Linux"
        />
        </a>
        <input type="checkbox" id="toggler">
        <label for="toggler"><i class='bx bx-menu'></i></label>
        <div class="menu">
            <ul class="list">
                <li><a href="historia.html">Historia</a></li>
                <li><a href="experiencias.html">Experiencias</a></li>
                <li><a href="distribuciones.html">Recomendaciones</a></li>
                <li><a href="soft-libre.html">Software Libre</a></li>
                <li><a href="supercomputadoras.html">Super Computadoras</a></li>
            </ul>
        </div>
    </nav>
    
        <h1 class="title">Experiencias</h1>
    </header>
    <main class="bg-red">
        <!-- *********** Main Here *********-->
        <h2>Experiencia de Ezequiel Su&#225;rez</h2>
        <p>
            Hace unos a&#241;os, me top&#233; con una compu viejita en mi placard. Era una notebook con un procesador Intel Celeron y apenas 512 MB de RAM. Aunque ya no pod&#237;a correr las &#250;ltimas versiones de Windows ni las apps m&#225;s modernas, no quer&#237;a hacerla percha, porque siempre me cop&#243; darles una segunda oportunidad a esos cachivaches.
        </p>
        <p>
            En ese momento, decid&#237; probar con Linux, un sistema operativo que es recontra eficiente y se banca bien la joda en hardware viejo. Despu&#233;s de averiguar un poco, eleg&#237; Linux Mint con la interfaz gr&#225;fica MATE, una versi&#243;n piola y ligera, y me mand&#233; a instalarla en la notebook.
        </p>
        <p>
            La instalaci&#243;n fue m&#225;s f&#225;cil de lo que me esperaba, y en un toque ten&#237;a un sistema operativo que funcionaba en mi notebook. Lo que m&#225;s me sorprendi&#243; fue lo r&#225;pido y fluido que andaba en comparaci&#243;n con el Windows que ten&#237;a antes.
        </p>
        <p>
            Con el tiempo, descubr&#237; una comunidad online que estaba a full y siempre dispuesta a dar una mano. Pude tunear mi sistema operativo a mi manera, instalando apps y ajustando la configuraci&#243;n seg&#250;n mis gustos. Adem&#225;s, la notebook empez&#243; a volar y funcionar mejor de lo que me imaginaba.
        </p>
        <p>
            Con Linux Mint y la interfaz MATE, mi notebook vieja volvi&#243; a la vida. La usaba para navegar por la web, escribir cosas y hacer tareas b&#225;sicas. Hasta me met&#237; a aprender a programar y nuevas habilidades, todo gracias a mi compu reacondicionada.
        </p>
    </main>
    <section class="bg-pink">
        <h2>Experiencia de Facundo Paron</h2>
        <p>
            Hace a&#241;os encontr&#233; una vieja laptop en mi armario, con un procesador Intel Celeron y solo 512 MB de RAM. Decid&#237; probar Linux Mint con la interfaz MATE, un sistema operativo ligero que instal&#233; f&#225;cilmente. Me sorprendi&#243; su velocidad y fluidez en comparaci&#243;n con Windows. Descubr&#237; una comunidad en l&#237;nea que me ayud&#243; a personalizar mi sistema, y mi laptop volvi&#243; a ser &#250;til. La us&#233; para navegar, escribir y aprender programaci&#243;n.
        </p>
        <p>
            Lo que esto destap&#243; en mi una curiosidad por Linux llev&#225;ndome a probar otros en tiempos libres.
        </p>
    </section>
    <article class="bg-blue">
        <h2>Experiencia de Jorge Valle</h2>
        <p>
            En mi caso, yo tengo una notebook de hace m&#225;s de 12 a&#241;os que no usaba por que ten&#237;a un windows 8 que ralentalizaba toda la maquina. Escuch&#233; que hab&#237;a muchas distribuciones de de linux que estaba dise&#241;ados para correr en hardware antiguo. 
        </p>
        <p>Despu&#233;s me decid&#237; por Xubuntu, dise&#241;ada para computadoras viejitas, eso si cambi&#233; el disco HHD por un SSD y agreg&#233; 2 gigas de ram para tener 4. </p>
        <p>
            Increiblemente la computadora renaci&#243; y su velocidad es estupenda. Es cierto que la interfaz gr&#225;fica no es tan vistoza, pero el rendimiento que alcanza lo compensa con creces. En especial, cumple con el objetivo que ten&#237;a de poder utilizarla para programar y estudiar.  
        </p>

        <h2>Conclusiones, ¿por qué deberíamos darle una oportunidad a Linux?</h2>
        <p>
            Una de las ventajas m&#225;s destacadas de Linux es que es un sistema de c&#243;digo abierto. Esto significa que su c&#243;digo fuente est&#225; disponible para que cualquiera lo examine, lo que promueve la transparencia y la colaboraci&#243;n. Adem&#225;s, el software libre se basa en cuatro libertades que permiten a los usuarios ejecutar, estudiar, modificar y redistribuir el software, lo que brinda un alto grado de control y libertad. 
        </p>
        <p>
            Si hablamos de seguridad Linux a menudo se considera m&#225;s seguro que otros sistemas operativos, en parte debido a su modelo de gesti&#243;n de paquetes y repositorios de software. Esto ayuda a reducir la vulnerabilidad al malware y facilita la administraci&#243;n de actualizaciones.
        </p>
        <p>
            Tambi&#233;n Linux es conocido por su eficiencia en el uso de recursos, lo que lo hace adecuado para hardware m&#225;s antiguo y nuevo. Puede funcionar de manera eficiente incluso en sistemas con recursos limitados.
        </p>
        <p>
            Adem&#225;s La amplia gama de distribuciones de Linux permite elegir una que se adapte a sus necesidades espec&#237;ficas, desde el desarrollo de software hasta la ciberseguridad. Esta versatilidad es una ventaja significativa.
        </p>
        <p>
            Es completamente gratis, no requiere licencias ni pagos.
            Tiene soporte comunitario, lo que hace que puedas tener mucha diversidad de aportes de usuarios, lo que facilita la solución de problemas y la obtención de ayuda.
        </p>
        <p>
            Y por supuesto si las supercomputadoras eligen Linux por algo es, y esto demuestra su capacidad para manejar cargas de trabajo exigentes y su escalabilidad.
        </p>
        <p>
            Para resumir habr&#237;a que darle una oportunidad a Linux debido a sus m&#250;ltiples ventajas. Linux es un sistema de c&#243;digo abierto que promueve la transparencia y la libertad de los usuarios. Ofrece una seguridad s&#243;lida, eficiencia en el uso de recursos, una variedad de distribuciones para adaptarse a tus necesidades, es gratuito y cuenta con un amplio soporte comunitario.
        </p>
        <p>
            Adem&#225;s, su &#233;xito en supercomputadoras demuestra su capacidad y escalabilidad en entornos exigentes. En conjunto, estas cualidades hacen de Linux una opci&#243;n atractiva como sistema operativo en una variedad de contextos.
        </p>
    </article>
    <footer class="bg-pink">
        <!--********** footer Here ************-->
        <p class="foot_later"><b>Integrantes:</b></p>
        <p class="foot_later">| Jorge Valle |</p>
        <p class="foot_later">| Facundo Paron |</p>
        <p class="foot_later">| Ezequiel Su&#225;rez|</p>
    </footer>
    </div>
</body>
</html>