<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link 
        href="https://fonts.googleapis.com/css2?family=Lato:wght@300;400&family=Lobster&family=Montserrat:ital,wght@0,300;0,700;1,700;1,800&display=swap"
        rel="stylesheet"
    >

    <link href='https://unpkg.com/boxicons@2.1.4/css/boxicons.min.css' rel='stylesheet'>
    <link rel="stylesheet" href="../styles/normalize.css" />
    <link rel="stylesheet" href="../styles/styles.css" />
    
    <title>Supercomputadoras</title>
    
</head>
<body>
    <div class="container">
    <header class="">
    <!-- ********* header Here ***********-->
    <nav class="navbar">
        <a href="../index.html" class="logo"><img
            class="logo-image"
            src="../assets/logos/Tux.svg.png"
            alt=" logo Linux"
        />
        </a>
        <input type="checkbox" id="toggler">
        <label for="toggler"><i class='bx bx-menu'></i></label>
        <div class="menu">
            <ul class="list">
                <li><a href="historia.html">Historia</a></li>
                <li><a href="experiencias.html">Experiencias</a></li>
                <li><a href="distribuciones.html">Recomendaciones</a></li>
                <li><a href="soft-libre.html">Software Libre</a></li>
                <li><a href="supercomputadoras.html">Super Computadoras</a></li>
            </ul>
        </div>
    </nav>
    
        <h1 class="title">Super Computadoras</h1>
    </header>
    <main class="bg-red">
        <!-- *********** Main Here *********-->
        
        <p>
            Cada seis meses, la lista Top 500 dice cu&#225;les son las supercomputadoras m&#225;s potentes del mundo. Y entre otros datos, Linux destaca como el sistema operativo de casi todos.
        </p>
        <figure>
            <img src="../assets/images/img-3-1.jpeg" class="img-content" alt="super computadora">
        </figure>
        <p>
            Hay muchas razones para el &#233;xito de Linux en el mundo de la supercomputaci&#243;n, y la primera de ellas es que Linux es algo as&#237; como una variante m&#225;s de los sistemas comerciales UNIX. Una especie de &quot;primo hermano&quot; de esas plataformas que dominaban ese mercado y que manten&#237;an muchas similitudes con esta alternativa Open Source. El paso desde esos sistemas comerciales (y privativos/propietarios) hacia Linux, aunque ciertamente no fuera trivial, era mucho m&#225;s asumible que tratar de migrar todas esas prestaciones a otras plataformas.
        </p>
        <figure>
            <img src="../assets/images/img-3-2.jpeg" class="img-content" alt="super computadora">
            <figcaption>
                <small class="caption">El crecimiento de Linux en cuota de mercado en el mundo de la supercomputaci&#243;n</small>
            </figcaption>
        </figure>

        
    </main>
    <section class="bg-pink">
        
        <p>
            A esas semejanzas y ese origen en com&#250;n de los sistemas UNIX y Linux se le unen otros argumentos clave que han hecho de Linux la alternativa perfecta para este tipo de m&#225;quinas:
Modularidad: la capacidad de personalizaci&#243;n y la versatilidad de Linux se basan en su legendaria modularidad. Linux es capaz de adaptarse a los entornos m&#225;s reducidos (IoT) y tambi&#233;n a los m&#225;s ambiciosos (supercomputaci&#243;n) gracias a una arquitectura modular en la que los componentes van a&#241;adi&#233;ndose o quit&#225;ndose seg&#250;n las necesidades.
        </p>
        <ol>
            <li>
                Un n&#250;cleo multidisciplinar: el kernel Linux que da nombre a todo el sistema operativo es tambi&#233;n la clave de esa versatilidad, porque en &#233;l encontramos soporte gen&#233;rico para todo tipo de tecnolog&#237;as, tanto aquellas que afectan al usuario final como las dedicadas a nichos mucho m&#225;s espec&#237;ficos. Al compilar el n&#250;cleo el usuario o desarrollador puede ir eligiendo qu&#233; caracter&#237;sticas quiere activar, logrando as&#237; que el propio nucleo se adapte a las necesidades concretas de la m&#225;quina en la que ese n&#250;cleo va a gobernar el resto de componentes del sistema operativo
            </li>
            <li>
                Escalabilidad: la capacidad de un servidor de adaptarse a cargas elevadas y la eficiencia o las prestaciones con las que lo hace es tambi&#233;n otra de las ventajas de un sistema operativo que como decimos puede crecer (o decrecer) conforme a las necesidades. No en vano encontramos Linux tanto en estas supercomputadoras o en grandes centros de datos como en nuestros smartphones (Android) o incluso en nuestros televisores o microondas
            </li>
            <li>
                Open Source: la naturaleza abierta de Linux hace que se convierta en la alternativa 
perfecta para que todo tipo de desarrollos puedan tener acceso total al sistema operativo para adaptarlo a sus necesidades, algo muy dif&#237;cil (o imposible) en otras alternativas en las que solo los fabricantes o desarrolladores originales pueden &quot;toquetear&quot;. La maximizaci&#243;n del rendimiento que es posible lograr con Linux hace que los responsables de esas supercomputadoras puedan ajustar todos los elementos de este sistema operativo a los recursos hardware espec&#237;ficos con los que cuentan. Una simbiosis software/hardware que podr&#237;amos comparar a la que Apple ofrece en sus dispositivos
            </li>
            <li>
                Coste: otro de los factores clave es evidentemente el del coste de las tradicionales licencias, que era alt&#237;simo en el caso de sistemas operativos comerciales y que es cero en el caso de las distintas distribuciones y variantes Linux usadas en estos supercomputadores. Hay desde luego un coste a la hora de adaptar esas distribuciones a una supercomputadora en concreto, pero eso forma parte de esas tareas de maximizaci&#243;n del rendimiento
            </li>
        </ol>
        <p>
            Fuente: <a href="https://www.xataka.com/especiales/linux-es-lider-absoluto-en-supercomputacion-por-que-windows-o-macos-no">
                https://www.xataka.com/especiales/linux-es-lider-absoluto-en-supercomputacion-por-que-windows-o-macos-no
                    </a>
        </p>
    </section>
    <article class="bg-blue">
        
        <div class="youtube-wrapper">
            <div class="youtube">
                <iframe 
                    width="560" 
                    height="315" 
                    src="https://www.youtube.com/embed/wnqpFM0J2Ms?si=MvZ2IS0nqhHvuYke" 
                    title="YouTube video player" 
                    frameborder="0" 
                    allow="accelerometer; 
                    autoplay; 
                    clipboard-write; 
                    encrypted-media; 
                    gyroscope; 
                    picture-in-picture; 
                    web-share" 
                    allowfullscreen>
                </iframe>
            </div>
        </div>
    </article>
    
    <footer class="bg-pink">
        <!--********** footer Here ************-->
        <h3 class="foot_later">Integrantes:</h3>
        <p class="foot_later">| Jorge Valle |</p>
        <p class="foot_later">| Facundo Paron |</p>
        <p class="foot_later">| Eze Su&#225;rez|</p>
    </footer>
    </div>
</body>
</html>